// 1. Если переменная a равна нулю, то выведите ‘Верно’, иначе выведите ‘Неверно’.
// let a = 0;
// let result = a === 0 ? 'Верно' : 'Неверно';
// console.log(result);

// 2. Если переменная a больше нуля, то выведите ‘Верно’, иначе выведите ‘Неверно’.
// let a = -5;
// let result = a > 0 ? 'Верно' : 'Неверно';
// console.log(result);

// 3.  Если переменная a меньше нуля, то выведите ‘Верно’, иначе выведите ‘Неверно’.
// let a = -5;
// let result = a < 0 ? 'Верно' : 'Неверно';
// console.log(result);

// 4. Если переменная a больше или равна нулю, то выведите ‘Верно’, иначе выведите ‘Неверно’.
// let a = -5;
// let result = a >= 0 ? 'Верно' : 'Неверно';
// console.log(result);

// 5. Если переменная a меньше или равна нулю, то выведите ‘Верно’, иначе выведите ‘Неверно’.
// let a = 0;
// let result = a <= 0 ? 'Верно' : 'Неверно';
// console.log(result);

// 6.  Если переменная a не равна нулю, то выведите ‘Верно’, иначе выведите ‘Неверно’.
// let a = -8;
// let result = a != 0 ? 'Верно' : 'Неверно';
// console.log(result);

// 7. Если переменная a равна ‘test’, то выведите ‘Верно’, иначе выведите ‘Неверно’.
// let a = 'Test';
// let result = a === 'test' ? 'Верно' : 'Неверно';
// console.log(result);

// 8. Если переменная a равна ‘1’ и по значению и по типу, то выведите ‘Верно’, иначе выведите ‘Неверно’.
// let a = '5';
// let result = a === '1' ? 'Верно' : 'Неверно';
// console.log(result);


// 9. Если переменная a больше нуля и меньше 5-ти, то выведите ‘Верно’, иначе выведите ‘Неверно’.
// let a = 8;
// let result = a > 0 && a < 5 ? 'Верно' : 'Неверно';
// console.log(result);


// 10.  Если переменная a равна нулю или равна двум, то прибавьте к ней 7, иначе поделите ее на 10. Выведите новое значение переменной на экран.
// let a = 1;
// let result = a === 0 || a === 2 ? alert(a + 7) : alert(a / 10);


// 11. Если переменная a равна или меньше 1, а переменная b больше или равна 3, то выведите сумму этих переменных, иначе выведите их разность (результат вычитания).
// let a = 1;
// let b = 3;
// let result = (a <= 1 && b >= 3) ? console.log(a + b) : console.log(a - b);


// 12. Если переменная a больше 2-х и меньше 11-ти, или переменная b больше или равна 6-ти и меньше 14-ти, то выведите ‘Верно’, в противном случае выведите ‘Неверно’.
// let a = 1;
// let b = 1;
// let result = (a > 2 && a < 11 || b >= 6 && b < 14) ? console.log('Верно') : console.log('Неверно');


// 13. Переменная num может принимать 4 значения: 1, 2, 3 или 4. Если она имеет значение ‘1’, то в переменную result запишем ‘зима’, если имеет значение ‘2’ – ‘весна’ и так далее. Решите задачу через switch-case.
// let num = prompt('Введите число от 1 до 4');
// switch (num) {
//     case '1':
//         alert('зима');
//         break;
//     case '2':
//         alert('весна');
//         break;
//     case '3':
//         alert('лето');
//         break;
//     case '4':
//         alert('осень');
//         break;
//     default:
//         alert('Нет таких значений');
// }
